{
    "aboutMe": "I am an enthusiastic developer that strives to learn something new every day. One of my greatest passions is programming and I aspire to master it.\nI view Software development as both an art form and a profession, and I'm an advocate for Software Craftsmanship and Clean Code methodologies.",
    "expertness": [
        {
            "name": "Web Development1",
            "description": "I have experience building websites and chrome extentions using JavaScript,React,HTML,CSS",
            "icon": "icon-bulb"
        },
        {
            "name": "Data Structures & Algorithms1",
            "description": "As coming from the CS background, I have good grasp over fundamental concepts of DSA",
            "icon": "icon-phone3"
        },
        {
            "name": "Dev Ops",
            "description": "I am pursuing my internship with DevOps team at Juniper and working with tools like Jenkins, Docker, K8s",
            "icon": "icon-data"
        },
        {
            "name": "Dev Ops",
            "description": "Jenkins , Kubernetes , Docker",
            "icon": "icon-data"
        },
        {
            "name": "Graphic Design",
            "description": "My friend knows .. P",
            "icon": "icon-layers2"
        },
        {
            "name": "Digital Marketing",
            "description": "I use Instagram eight hours a day :)",
            "icon": "icon-phone3"
        }
    ],
    "experience": [
        {
            "company": "CodeValue",
            "companySite": "https://codevalue.net/",
            "years": "2016 – 2019",
            "title": "Senior Full-Stack Developer",
            "description": "Senior Developer and consultant in multiple software projects for numerous clients. Providing cutting edge solutions for both client side and server side applications.\n\nSelected Projects:\n»» Architected and led the implementation of Role-Based authorization, and RADIUS Authentication in a single page web application. \n\n  »» Programmed, tested, and implemented a MicroServices-based, 3d model generator Web server for a government client using NodeJS, express and Python.\n\n As part of my work, I conducted technical telephone interviews for candidates."
        },
        {
            "company": "Intergraph",
            "companySite": "http://www.intergraph.com/",
            "years": "2015-2016",
            "title": "Full-Stack Developer",
            "description": "Full-stack developer, Desktop application, building  modules from the characterization stage, UI, and implementation. \nAs part of my work, I created a number of web tools."
        },
        {
            "company": "Iscar",
            "companySite": "https://www.iscar.com/index.aspx/countryid/1",
            "years": "2012-2015",
            "title": "Software Developer",
            "description": "Front-end developer, Desktop application, As part of my job I was responsible for the development, characterization and implementation of components in the system."
        },
        {
            "company": "Verint",
            "companySite": "https://www.verint.com",
            "years": "2011-2011",
            "title": "Software Developer",
            "description": "Full-stack developer."
        }
    ],
    "education": "<b>B.Sc Software Engineering<\/b>, ORT Braude College in Karmiel, Holder of a Diploma of Electrical Engineering - Electronics, School of Technology Rodman Kiryat Yam ."
}